<h3>Import Module</h3>

In [61]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from datetime import datetime
from sklearn.preprocessing import StandardScaler

<h3>Data Cleaning</h3>

In [44]:
df = pd.read_csv('customer_analysis.csv', sep='\t')
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,04-09-2012,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,08-03-2014,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,21-08-2013,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,10-02-2014,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,19-01-2014,94,173,...,5,0,0,0,0,0,0,3,11,0

In [45]:
# Check missing value
df.isnull().sum()

ID                      0
Year_Birth              0
Education               0
Marital_Status          0
Income                 24
Kidhome                 0
Teenhome                0
Dt_Customer             0
Recency                 0
MntWines                0
MntFruits               0
MntMeatProducts         0
MntFishProducts         0
MntSweetProducts        0
MntGoldProds            0
NumDealsPurchases       0
NumWebPurchases         0
NumCatalogPurchases     0
NumStorePurchases       0
NumWebVisitsMonth       0
AcceptedCmp3            0
AcceptedCmp4            0
AcceptedCmp5            0
AcceptedCmp1            0
AcceptedCmp2            0
Complain                0
Z_CostContact           0
Z_Revenue               0
Response                0
dtype: int64

In [46]:
# fill the missing value in the income
df['Income'].fillna(df['Income'].median(), inplace=True)
df.isna().any()

ID                     False
Year_Birth             False
Education              False
Marital_Status         False
Income                 False
Kidhome                False
Teenhome               False
Dt_Customer            False
Recency                False
MntWines               False
MntFruits              False
MntMeatProducts        False
MntFishProducts        False
MntSweetProducts       False
MntGoldProds           False
NumDealsPurchases      False
NumWebPurchases        False
NumCatalogPurchases    False
NumStorePurchases      False
NumWebVisitsMonth      False
AcceptedCmp3           False
AcceptedCmp4           False
AcceptedCmp5           False
AcceptedCmp1           False
AcceptedCmp2           False
Complain               False
Z_CostContact          False
Z_Revenue              False
Response               False
dtype: bool

In [47]:
# change dt_customer to date time format
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'], format='%d-%m-%Y')

In [48]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Z_CostContact,Z_Revenue,Response
0,5524,1957,Graduation,Single,58138.0,0,0,2012-09-04,58,635,...,7,0,0,0,0,0,0,3,11,1
1,2174,1954,Graduation,Single,46344.0,1,1,2014-03-08,38,11,...,5,0,0,0,0,0,0,3,11,0
2,4141,1965,Graduation,Together,71613.0,0,0,2013-08-21,26,426,...,4,0,0,0,0,0,0,3,11,0
3,6182,1984,Graduation,Together,26646.0,1,0,2014-02-10,26,11,...,6,0,0,0,0,0,0,3,11,0
4,5324,1981,PhD,Married,58293.0,1,0,2014-01-19,94,173,...,5,0,0,0,0,0,0,3,11,0

In [49]:
label_encoder = LabelEncoder()

# Encode the categorical features
df['Education'] = label_encoder.fit_transform(df['Education'])
df['Marital_Status'] = label_encoder.fit_transform(df['Marital_Status'])

# Display the first few rows of the dataset to confirm the changes
df[['Education', 'Marital_Status']].head()

   Education  Marital_Status
0          2               4
1          2               4
2          2               5
3          2               5
4          4               3

In [50]:
# Calculate the age of each customer using the current year and their birth year
df['Age'] =  datetime.now().year - df['Year_Birth']

# Display the first few rows to confirm the new feature
df[['Year_Birth', 'Age']].head()

   Year_Birth  Age
0        1957   66
1        1954   69
2        1965   58
3        1984   39
4        1981   42

In [51]:
# List of expenditure-related columns
expenditure_columns = ['MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds']

# Calculate the total expenditure across various categories
df['Spent'] = df[expenditure_columns].sum(axis=1)

# Display the first few rows to confirm the new feature
df[['Spent'] + expenditure_columns].head()

,Spent,MntWines,MntFruits,MntMeatProducts,MntFishProducts,MntSweetProducts,MntGoldProds
0,1617,635,88,546,172,88,88
1,27,11,1,6,2,1,6
2,776,426,49,127,111,21,42
3,53,11,4,20,10,3,5
4,422,173,43,118,46,27,15

In [52]:
# Define a function to derive the "Living_With" feature based on "Marital_Status"
def living_with(status):
    if status in [0, 1, 2, 4, 6]:  # 'Absurd', 'Alone', 'YOLO', 'Widow', 'Absurd'
        return 'Alone'
    elif status in [3, 5]:  # 'Married', 'Together'
        return 'Partner'
    else:
        return 'Other'

# Apply the function to the "Marital_Status" column to create the "Living_With" feature
df['Living_With'] = df['Marital_Status'].apply(living_with)

# Display the first few rows to confirm the new feature
df[['Marital_Status', 'Living_With']].head()

   Marital_Status Living_With
0               4       Alone
1               4       Alone
2               5     Partner
3               5     Partner
4               3     Partner

In [53]:
# Calculate the total number of children (both young ones and teenagers) in a household
df['Children'] = df['Kidhome'] + df['Teenhome']

# Display the first few rows to confirm the new feature
df[['Kidhome', 'Teenhome', 'Children']].head()

   Kidhome  Teenhome  Children
0        0         0         0
1        1         1         2
2        0         0         0
3        1         0         1
4        1         0         1

In [54]:
# Calculate the family size based on the number of children and the marital status
df['Family_Size'] = df['Children'] + df['Living_With'].apply(lambda x: 2 if x == 'Partner' else 1)

# Display the first few rows to confirm the new feature
df[['Living_With', 'Children', 'Family_Size']].head()

  Living_With  Children  Family_Size
0       Alone         0            1
1       Alone         2            3
2     Partner         0            2
3     Partner         1            3
4     Partner         1            3

In [55]:
# Determine if a customer is a parent based on the number of children
df['Is_Parent'] = df['Children'].apply(lambda x: 1 if x > 0 else 0)

# Display the first few rows to confirm the new feature
df[['Children', 'Is_Parent']].head()

   Children  Is_Parent
0         0          0
1         2          1
2         0          0
3         1          1
4         1          1

In [56]:
# Define a function to categorize the education level
def categorize_education(level):
    if level in [0, 1]:  # '2n Cycle', 'Basic'
        return 'Low'
    elif level in [2, 3]:  # 'Graduation', 'Master'
        return 'Medium'
    else:  # 'PhD'
        return 'High'

# Apply the function to the "Education" column to create the new categorization
df['Education'] = df['Education'].apply(categorize_education)

# Display the first few rows to confirm the changes
df['Education'].head()

0    Medium
1    Medium
2    Medium
3    Medium
4      High
Name: Education, dtype: object

In [57]:
# Check the unique values in each column to identify potential redundant columns
potential_redundant_columns = df.nunique()

# Display columns with only one unique value (potential redundant columns)
potential_redundant_columns[potential_redundant_columns == 1]

Z_CostContact    1
Z_Revenue        1
dtype: int64

In [58]:
# Drop redundant columns
df.drop(['Z_CostContact', 'Z_Revenue'], axis=1, inplace=True)

In [59]:
df.head()

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,AcceptedCmp1,AcceptedCmp2,Complain,Response,Age,Spent,Living_With,Children,Family_Size,Is_Parent
0,5524,1957,Medium,4,58138.0,0,0,2012-09-04,58,635,...,0,0,0,1,66,1617,Alone,0,1,0
1,2174,1954,Medium,4,46344.0,1,1,2014-03-08,38,11,...,0,0,0,0,69,27,Alone,2,3,1
2,4141,1965,Medium,5,71613.0,0,0,2013-08-21,26,426,...,0,0,0,0,58,776,Partner,0,2,0
3,6182,1984,Medium,5,26646.0,1,0,2014-02-10,26,11,...,0,0,0,0,39,53,Partner,1,3,1
4,5324,1981,High,3,58293.0,1,0,2014-01-19,94,173,...,0,0,0,0,42,422,Partner,1,3,1

In [62]:
df['Living_With'] = label_encoder.fit_transform(df['Living_With'])
df['Education'] = label_encoder.fit_transform(df['Education'])

In [63]:
features_to_scale = df.drop(['ID', 'Dt_Customer', 'Response'], axis=1).columns

# Initialize the standard scaler
scaler = StandardScaler()

# Apply scaling to the features
df[features_to_scale] = scaler.fit_transform(df[features_to_scale])

# Display the first few rows after scaling
df[features_to_scale].head()

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Recency,MntWines,MntFruits,MntMeatProducts,...,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Age,Spent,Living_With,Children,Family_Size,Is_Parent
0,-0.985345,0.664587,0.251004,0.235696,-0.825218,-0.929894,0.307039,0.983781,1.551577,1.679702,...,-0.28014,-0.262111,-0.11651,-0.097282,0.985345,1.679417,-1.348845,-1.264505,-1.759115,-1.584605
1,-1.235733,0.664587,0.251004,-0.235454,1.032559,0.906934,-0.383664,-0.870479,-0.636301,-0.713225,...,-0.28014,-0.262111,-0.11651,-0.097282,1.235733,-0.961275,-1.348845,1.396361,0.446548,0.631072
2,-0.317643,0.664587,1.180340,0.773999,-0.825218,-0.929894,-0.798086,0.362723,0.570804,-0.177032,...,-0.28014,-0.262111,-0.11651,-0.097282,0.317643,0.282673,0.742098,-1.264505,-0.656283,-1.584605
3,1.268149,0.664587,1.180340,-1.022355,1.032559,-0.929894,-0.798086,-0.870479,-0.560857,-0.651187,...,-0.28014,-0.262111,-0.11651,-0.097282,-1.268149,-0.918094,0.742098,0.065928,0.446548,0.631072
4,1.017761,-1.757991,-0.678332,0.241888,1.032559,-0.929894,1.550305,-0.389085,0.419916,-0.216914,...,-0.28014,-0.262111,-0.11651,-0.097282,-1.017761,-0.305254,0.742098,0.065928,0.446548,0.631072